/* No comment provided by engineer. */
"GCDAsyncSocketClosedError" = "Socket on suljettu toiselta puolelta";

/* No comment provided by engineer. */
"GCDAsyncSocketConnectTimeoutError" = "Yhteyden aikakatkaisu";

/* No comment provided by engineer. */
"GCDAsyncSocketReadMaxedOutError" = "Lukuoperaatio ylitti enimmäispituutensa";

/* No comment provided by engineer. */
"GCDAsyncSocketReadTimeoutError" = "Aikakatkaisu luettaessa";

/* No comment provided by engineer. */
"GCDAsyncSocketWriteTimeoutError" = "Aikakatkaisu kirjoitettaessa";

